{
  "title": "CSR – Corporate Social Responsibility | CSI DMC",
  "text": "CSR – Corporate Social Responsibility\nCorporate social responsibility is important CSI DMC. Our policies show that we proactively and thoroughly held ourselves to higher standards in ethical behavior, environmental sustainability, data security and more.\nOur business is founded on trust and public confidence. We strive to be in strict compliance with all laws and regulations that apply to conducting our business. When any law or regulation seems unclear or ambiguous, employees are urged to consult their immediate supervisor to seek assistance in determining lawful procedures.\nTo this end, everything we do is driven by a strong client service methodology, inside and out. All decisions regarding company policy have this premise in mind.\nSustainability\nCSI DMC recognizes that the long-term health of our business is directly connected to the health of the planet and local communities. We remain focused on sourcing environmental solutions that will lessen our footprint, while serving as an example to our peers. CSI DMC office operating at each destination identifies and works to minimize relevant environmental impacts under the applicable laws within jurisdiction.\nCSI DMC proactively pursues opportunities to reuse materials from events and meetings, otherwise may be wasted. Also, at given opportunities, CSI DMC suggest ideas to donate untouched and unconsumed food and beverage items as well as florals to local food kitchens and senior housing communities.\nApart from legal obligations, our company will proactively protect the environment. Examples of relevant activities include:\nRecycling\nConserving energy\nOrganizing reforestation excursions\nUsing environmentally-friendly technologies wherever possible\nData Security and Privacy\nProtecting the privacy of our customers, vendors and employees is critical to our ability to maintain their trust. CSI DMC take precautions to safeguard sensitive information, to include customer data, in order to ensure a safe and secure online environment.\nAnyone Processing Personal Data must comply with principles of good practice. These provide that Personal Data must be:\nProcessed fairly, lawfully and in a transparent manner in relation to individuals.\nCollected for specified, explicit and legitimate purposes and not further processed in a manner that is incompatible with those purposes.\nAdequate, relevant and limited to what is necessary in relation to the purpose for which they are processed.\nNot kept longer than necessary for the purpose for which the Personal Data is processed.\nProcessed in line with Data Subjects’ rights.\nVolunteering\nCSI DMC will encourage its employees to volunteer. They can volunteer through programs organized internally or externally. Our company may sponsor volunteering events from other organizations.\nSupporting the community\nCSI DMC may initiate and support community investment and educational programs. For example, it may begin partnerships with vendors for renovating public buildings. It can provide support to nonprofit organizations or movements to promote cultural and economic development of global and local communities.\nThe CSI tDMC eam is passionate about our destinations, and have developed deep ties in their communities. We can organize volunteer sessions, give back events, and unique service opportunities that will resonate directly with our clients as a part of initiatives.\n  ",
  "images": [
    "https://dc.ads.linkedin.com/collect/?pid=500588&fmt=gif",
    "https://www.facebook.com/tr?id=262969157691605&ev=PageView&noscript=1",
    "https://149363291.v2.pressablecdn.com/wp-content/uploads/csi-dmc-logo2-header-1.png",
    "https://149363291.v2.pressablecdn.com/wp-content/uploads/sb-instagram-feed-images/csidmc.jpg",
    "https://149363291.v2.pressablecdn.com/wp-content/plugins/instagram-feed-pro/img/placeholder.png",
    "https://149363291.v2.pressablecdn.com/wp-content/plugins/instagram-feed-pro/img/placeholder.png",
    "https://149363291.v2.pressablecdn.com/wp-content/plugins/instagram-feed-pro/img/placeholder.png"
  ]
}