{
  "title": "Destination Events Trends, Event Planning Industry News | Blog | CSI DMC",
  "text": "\npress releases\nCSI DMC Expands into Arizona\nby\nFlor Rodriguez\n|\nAug 10, 2023\n|\nPress Releases PHOENIX, ARIZONA, August 10, 2023 - CSI DMC, the Destination and Event Management Company (DMC) clients trust to transform their events into exceptional experiences, has expanded its business operations into Arizona. CSI DMC's locally based team of destination experts...\nCSI DMC Welcomes Maddie Damario, CMP, to the National Sales Team (Chicago)\nby\nFlor Rodriguez\n|\nJul 25, 2023\n|\nPress Releases CSI DMC welcomes Maddie DaMario to the team as Vice President of National Sales. Based in Chicago, Illinois, Maddie brings her expertise in events and destination management, client relations, and operations to the dynamic role. A University of Missouri-Columbia alum,...\nCSI DMC Welcomes Taylor Abbate, DMCP, DES, HMCC, to its National Sales Team.\nby\nFlor Rodriguez\n|\nMay 30, 2023\n|\nPress Releases CSI DMC welcomes Taylor Abbate to the team as Director of National Sales. Based in Scottsdale, Arizona, Taylor brings her expertise in events and destination management, client relations, and operations to the dynamic role. A University of Missouri-Columbia alum,...\nCSI DMC Voted “Best DMC” across the USA.\nby\nFlor Rodriguez\n|\nNov 7, 2022\n|\nPress Releases CSI DMC is voted “Best DMC” across five USA regions CSI DMC is honored to have been voted a 2022 Stella Award winner for “Best DMC” across five regions in the USA. (Northeast, Southeast, Midwest, Southwest, and Far West!). The Stella Awards are the meeting industry’s...\n",
  "images": [
    "https://dc.ads.linkedin.com/collect/?pid=500588&fmt=gif",
    "https://www.facebook.com/tr?id=262969157691605&ev=PageView&noscript=1",
    "https://149363291.v2.pressablecdn.com/wp-content/uploads/csi-dmc-logo2-header-1.png",
    "https://149363291.v2.pressablecdn.com/wp-content/uploads/sb-instagram-feed-images/csidmc.jpg",
    "https://149363291.v2.pressablecdn.com/wp-content/plugins/instagram-feed-pro/img/placeholder.png",
    "https://149363291.v2.pressablecdn.com/wp-content/plugins/instagram-feed-pro/img/placeholder.png",
    "https://149363291.v2.pressablecdn.com/wp-content/plugins/instagram-feed-pro/img/placeholder.png"
  ]
}