{
  "title": "Destination Events Trends, Event Planning Industry News | Blog | CSI DMC",
  "text": "\nblog\nSustainable Team Building: Solutions and Success I CSI DMC\nby\nFlor Rodriguez\n|\nAug 3, 2023\n|\nBlog ,\nCSI Experiences ,\nCSI Insider ,\nCSI Team ,\nNews ,\nServices Sustainability has become a major theme for organizations, even if the rhetoric still needs to be fully integrated into a business's practices. This disconnect is not necessarily due to a lack of concern, though. For many companies, it's a question of how to quickly...\nPlanning an Unforgettable Company Retreat I CSI DMC\nby\nFlor Rodriguez\n|\nJul 1, 2023\n|\nBlog ,\nCSI Experiences ,\nNews ,\nServices  Looking to plan a company retreat that will invigorate your team, foster innovation, and cultivate a sense of togetherness? We've got some tips! First, clarify your goals and priorities. Are you looking to boost morale, inspire new ideas, or reward hardworking...\nWhat’s New in California I CSI DMC\nby\nFlor Rodriguez\n|\nJun 1, 2023\n|\nBlog ,\nCalifornia ,\nCSI Experiences ,\nNews A girl in ruby red slippers once famously said about Kansas, “There’s no place like home.” We would like to modify that quote.  We think there’s no place like California! From the glittering sapphire that is the Pacific Ocean to the vineyards of Napa to the mountains...\nBoston Insider: Spill the Tea\nby\nJenna Leone\n|\nApr 1, 2023\n|\nBlog ,\nBoston ,\nCSI Experiences ,\nNews You don't need to read the tea leaves to see the uptick in after-parties and glow-themed events in Boston! The CSI team recently produced an event that was beyond our clients' wildest gleams (glow pun!) inspired by the Lawn on D. Shares vendor-partner Erica with...\nWestin by the Water\nby\nJenna Leone\n|\nNov 2, 2022\n|\nBlog ,\nBoston ,\nCSI Experiences ,\nNews Located less than three miles from Boston Logan Airport, The Westin Hotel is ideally located in the vibrant Seaport District, just steps from iconic downtown attractions. Explore the city, enjoy an evening of relaxation, and walk just two blocks down to the Boston...\nBoston: Think Outside the Park\nby\nJenna Leone\n|\nNov 2, 2022\n|\nBlog ,\nBoston ,\nCSI Experiences ,\nNews BOSTON IS BOOMING! New England's largest city has the perfect historical and contemporary blend. There is something for everyone in the city affectionately referred to as Beantown. - from Museum tours to boat tours, sports to theaters, and new buildings to British...\n312 Bedrooms in a Bank\nby\nJenna Leone\n|\nNov 2, 2022\n|\nBlog ,\nBoston ,\nCSI Experiences ,\nNews The Langham, Boston is an iconic hotel housed in a national historic landmark, which was once the Federal Reserve Bank of Boston, built in 1922. The property began a new era of elegance after a two-year multimillion-dollar renovation with nods to its history as the...\nNew Venue in an Old City\nby\nJenna Leone\n|\nNov 2, 2022\n|\nBlog ,\nBoston ,\nCSI Experiences ,\nNews\n  If you're looking for a new venue space with amazing tech, MGM Music Hall at Fenway will rock your world! This brand-new tri-level concert venue...\nPower Up and Play\nby\nJenna Leone\n|\nNov 2, 2022\n|\nBlog ,\nBoston ,\nCSI Experiences ,\nNews The SoWa Power Station is celebrating its first year as a premier event space in Boston! Built in 1891 as the world ’s largest power-generating plant, it produced enough electricity to run the West End Street Railway. The century-old property’s structural elements...\nMeet us at “The Pav”\nby\nJenna Leone\n|\nNov 2, 2022\n|\nBlog ,\nBoston ,\nCSI Experiences ,\nNews Locally known as “The Pav” and featuring flexible event space accommodating up to 5,000 guests, Leader Bank Pavilion may be the perfect venue for your next event in Boston Seaport! Located less than a half mile from the Boston Convention and Exhibition Center, minutes...\nMini Golf with a Techy Twist\nby\nJenna Leone\n|\nNov 2, 2022\n|\nBlog ,\nBoston ,\nCSI Experiences ,\nNews Puttshack, the only upscale tech-infused mini golf experience with global food and drink, arrived in Boston October 2022! From their humble beginnings in the UK to their impactful journey into the US, Puttshack has created a vibrant and unique social entertainment...\nLiving it up at the Loews\nby\nFlor Rodriguez\n|\nAug 24, 2022\n|\nBlog ,\nCalifornia ,\nCSI Experiences ,\nNews The Loews Santa Monica Beach Hotel in Santa Monica, California, was ahead of the game when it decided to remodel its Pacific Garden. They knew that as Covid eased off and people were ready to be around each other in person once again, they would turn to a place like...\n« Older Entries\n",
  "images": [
    "https://dc.ads.linkedin.com/collect/?pid=500588&fmt=gif",
    "https://www.facebook.com/tr?id=262969157691605&ev=PageView&noscript=1",
    "https://149363291.v2.pressablecdn.com/wp-content/uploads/csi-dmc-logo2-header-1.png",
    "https://149363291.v2.pressablecdn.com/wp-content/uploads/sb-instagram-feed-images/csidmc.jpg",
    "https://149363291.v2.pressablecdn.com/wp-content/plugins/instagram-feed-pro/img/placeholder.png",
    "https://149363291.v2.pressablecdn.com/wp-content/plugins/instagram-feed-pro/img/placeholder.png",
    "https://149363291.v2.pressablecdn.com/wp-content/plugins/instagram-feed-pro/img/placeholder.png"
  ]
}